[
    {
        "title" : "Three reasons why you should become a home health aide (HHA)",
        "date" : "October 5, 2022",
        "img" : "https://img1.wsimg.com/isteam/stock/10494/:/cr=t:0%25,l:0%25,w:100%25,h:100%25/rs=w:1280",

        "description" :[ 
            {
            "sub_title" : "What does an HHA do?",
            "content": "A home health aide helps people who are chronically ill, or disabled and elderly adults who need help with daily activities. HHAs are companions for people who require help getting dressed, bathing, grooming, and doing light housekeeping.Personal care and home health aides are not required to have a degree. If you work for a home health care agency, like Cottage Home Care Services you have to complete formal training through a certified school, like the Brooklyn Insitute of Vocational Training on Liberty Ave, Queens, New York. There are several advantages to working as a HHA or PCA. Here are three specific reasons why you should consider becoming an HHA. "

        },
            {
            "sub_title" : "A hero at home",
            "content": "Elder care requires a lot of time, love, and effort. Family members find it difficult to balance a full-time job, kids, and the time needed to care for a loved one. It becomes demanding and more than they can handle. This is where a caretaker comes in to assist families by making sure their loved ones are given love and compassion, which brings them peace of mind. "

        },
            {
            "sub_title" : "Help with patient's healing process",
            "content": " Regardless of the client's unique diagnosis, the home health aide is there to provide consistent care in all circumstances. You're there to make your client happy by providing a sympathetic ear or a shoulder to cry on.Every day, home health aides show the world the importance of kindness, love, and strength. You can help those who provide skilled care by providing the human touch and emotional support that a patient needs to recover.You provide a sense of normalcy during what can be a very difficult time, in addition to your kindness, skill, and dependability. As an HHA, you have the ability to improve someone's health and happiness.You can teach and learn something new from your patients. Working as an HHA allows you to be a teacher, a healer, and a source of strength. "

        }
       

        ]
    },
    {
        "title" : "EARN UP TO $21 PER HOUR WITHOUT A DEGREE AS AN HHA/PCA",
        "date" : "September 29, 2022",
        "img" : "https://img1.wsimg.com/isteam/stock/10497/:/cr=t:3%25,l:4.21%25,w:80.65%25,h:80.65%25/rs=w:1280",

        "description" :[ 
            {
            "content": "Most jobs currently pay the minimum wage, regardless of your years of experience. Fortunately, as a certified Home Health Aide or Personable Care Aide, Cottage Home Care Services can offer you a stable and flexible career path in healthcare.Most decent-paying jobs require a degree that will take up to 4 years if you want to make $21 or more per hour. The good news is there are jobs in the healthcare sector where you can make this amount with just a certificate from the Brooklyn Institute of Vocational Training.Cottage Home Care Services is among the top home health care agencies in New York for seniors. We have demonstrated the quality of care and attention we pay to our patients and their loved ones to ensure they receive the benefits they deserve. Our customers and caregivers are prime examples of the standard of care we offer.With offices in Hicksville, Long Island, and Richmond Hill, Queens, New York, we serve most of the boroughs in the New York City area.       "

        },
            {
            "sub_title" : "Become a certified HHA through the Brooklyn Institute of Vocational Training ",
            "content": "We offer HHA training to ensure you become a certified Aide through the Brooklyn Institute of Vocational Training, which is the sister company of Cottage Home Care Services. Through our college, you can gain immediate employment and be on your way to becoming successful in the career path of healthcare.The Brooklyn Institute of Vocational Training gives back in many ways to its students and empowers communities throughout New York.We provide a learning atmosphere that will get you ready for the future. Our classes mix hands-on activities with more conventional teaching methods. When it comes to teachers our staff is committed and knowledgeable. Our professors are Registered Nurses with more than 30 years of experience.  "

        },
            {
            "sub_title" : "How Important Are HHAs?",
            "content": "For the thousands of Americans living with conditions that require daily care and supervision, the assistance of home health aides (or HHAs) is invaluable.Being able to live at home rather than in a long-term facility or hospital care gives patients who are elderly, physically disabled, terminally ill, or incapable of caring for themselves the opportunity to maintain a significant amount of personal autonomy.With the help of a home health aide (reporting to other medical professionals), a patient can maintain some level of independence and comfort. "

        },
            {
            "sub_title" : "What is CDPAP?",
            "content": "The Consumer Directed Personal Assistance Program (or 'CDPAP') enables Medicaid-eligible individuals to choose, supervise, and direct their caregivers. The benefit of this program is that it enables users to employ family members and friends, removing any potential stress caused by having strangers over as well as problems caused by a language barrier. It greatly benefits both parties. Without having a stranger in your home, your caregiver is paid while providing you with the comfort and care you deserve. You can make $21 per hour by working for Cottage Home Health Care Services. No certification is required for this program."

        },
            {
            "sub_title" : "Immediate Job Placement With Cottage Home Care Services",
            "content": "The Brooklyn Institute of Vocational Training emphasizes your success. Our sister company, Cottage Home Care Services, will ensure you are hired soon after you graduate so feel free to reach out to us with questions or concerns. Call 516-367-2266."

        }
       

        ]
    }
]